; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:	sajjad mohammadi <sajjad.mohammadi@gmail.com>
; Homepage:	http://www.sajjad-mohammadi.blogsky.com/
; ترجمه : سجاد محمدي
; تلفن :
; 00989358927430
;تقديم به همسر عزيزم
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode (UTF-8) format and Zip it to preserve formatting
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&موافقم"
CANCEL_BUT = "&لغو كردن"
MAIN_DEST_DIR_LABEL = "&دایرکتوری مقصد:"
MAIN_FILE_LABEL = "&آرشیو \ نصب به خروجي:"
MENU_FILE_LABEL = "&فايل"
MENU_FILE_QUIT_LABEL = "&خروج"
MENU_EDIT_LABEL = "&ویرایش"
MENU_EDIT_PREFS_LABEL = "&تنظیمات"
MENU_HELP_LABEL = "&کمک"
MENU_HELP_WEB_LABEL = "%s &وب سايت"
PREFS_TITLE_LABEL = "تنظیمات"
PREFS_UNIEXTRACT_OPTS_LABEL = "گزینه های تنظيم استخراج"
PREFS_HISTORY_LABEL = "ردیابی آرشیو و تاریخچه"
PREFS_FORMAT_OPTS_LABEL = "گزینه هاي فرمت خاص"
PREFS_LANG_LABEL = "&زبان"
PREFS_DEBUG_LABEL = "&اشکال زدایی دایرکتوری فایل:"
PREFS_WARN_EXECUTE_LABEL = "&اخطار قبل از اجرای فایل"
PREFS_REMOVE_DUPE_LABEL = "&حذف فایل های تکراری"
PREFS_REMOVE_TEMP_LABEL = "حذف و فایل های موقت"
PREFS_APPEND_EXT_LABEL = "&افزودن پرونده و پسوندهای فایل"
METHOD_ADMIN_RADIO = "%s نصب مديريت"
METHOD_EXTRACTION_RADIO = "%s استخراج"
METHOD_HEADER = "%s استخراج"
METHOD_MSI_NOTE_LABEL = "یادداشت:"
METHOD_MSI_REQUIRES_LABEL = "msi2xml نیاز به"
METHOD_MSI_URL_LABEL = "MSXML 6.0 Parser"
METHOD_RADIO_LABEL = "روش استخراج"
METHOD_SWITCH_RADIO = "%s گزینه"
METHOD_NOTIS_RADIO = "هنوز نصب نيست InstallShield"
METHOD_TEXT_LABEL = "%s پشتیبانی از روش های زیر برای استخراج س٪ بسته نیست. متاسفانه ، هیچ یک از این روشها 100 ٪ قابل اطمینان نيستند. اگر روش به طور پیش فرض به نظر نمی رسد ، لطفا به متد پيش فرض انتخاب کنید و روش های جایگزین را انتخاب كنيد."
METHOD_UNPACKER_RADIO = "%s Unpacker"

; GUI control functions
DOES_NOT_EXIST = "وجود ندارد.%n"
EXTRACT_TO = "استخراج به"
INVALID_DIR_SELECTED =  "%s این دایرکتوری معتبر نیست."
INVALID_FILE_SELECTED = "%sیک فایل معتبرانتخاب کنید ."
OPEN_FILE = "باز کردن فای"
SELECT_FILE = "انتخاب فای"
WRITE_TO = "نوشتن به"

; Common terms
TERM_ARCHIVE = "آرشیو"
TERM_COMPRESSED = "فایل های فشرده"
TERM_DISK = "دیسک"
TERM_EBOOK = "کتاب"
TERM_ECARD = "اي کارت "
TERM_ENCODED = "فایل کد گذاری شده"
TERM_EXECUTABLE = "اجرایی"
TERM_FAILED = "شکست خورد"
TERM_HELP = "فایل راهنما"
TERM_HOTFIX = "hotfix"
TERM_IMAGE = "تصویر"
TERM_INSTALLER = "نصب"
TERM_PACKAGE = "بسته"
TERM_PATCH = "پچ"
TERM_SFX = "خود استخراج"
TERM_STAGE = "صحنه"
TERM_SUCCEEDED = "موفق"
TERM_TESTING = "تست"
TERM_UNKNOWN = "نامشخص"
TERM_UNPACKED = "فله اي"
TERM_UPDATER = "updater"

; Status messages
SCANNING_FILE = "اسکن فایل برای تعیین تايپ."
SCANNING_EXE = "اسکن فايل و پرونده ها ."
EXTRACTING = "استخراج فایل ها از:"
INIT_WAIT = "در حال انتظار برای نصب به مقداردهی اولیه لطفا صبر کنید."

; Custom prompts
CONVERT_CDROM = "%s  در عوض ، این  سي دي ها را با ایزو سی دی ايميج گرفته ، که پس از آن استخراج کرده و تبدیل مي كنيم.٪ ٪ آیا مایل به ادامه هستید؟ ٪ این فرایند چند دقیقه وقت خواهد برد."
CONVERT_CDROM_STAGE1_FAILED = "خطا : سی دی نمی تواند به ايميج تبدیل شود.  مطمئن شوید که فایل به درستی نشانه دار است و فرمت شده باشد."
CONVERT_CDROM_STAGE2_FAILED = "خطا : ايميج ایزو ایجاد شده است ، اما نمی تواند تبدیل شده باشد. ٪ آیا مایل به نگه داشتن ايميج ایزو برای تجزیه و تحلیل بیشترهستيد؟"
CONVERT_BIN_MISSING = "خطا : نمیتوان يافت هر دو فايل بين وزسي يو اي را و هر دو مورد نياز است."
INIT_COMPLETE = " لطفا خروج دهی اولیه نصب را وارد كرده، و سپس دکمه تایید را ادامه دهد."
WISE_MSI_PROMPT = "توجه : این روش فقط با محيط خاص بسته های نصب برای ویندوز کار می کند.اگر اين روش خاص نصب و راه اندازی آغاز شود به سادگی ورودی را اعمال كنيد ، و اگر فايلي وجود نداشت لطفا از برنامه خارج شويد ، ودوباره اقدام كنيد.آيا مايل به ادامه هستید؟ "
UNPACK_PROMPT = "این پرونده با فشردگی بسته بندی شده است، اما نمی توان آنها را استخراج كرد.  ممکن است اين فرمت پشتیبانی نشده باشد ، یا به دلیل ديگر ،آیا مایل به باز کردن این فایل هستيد؟   نكته : پرونده باز خواهد شد به نام"
UNPACK_FAILED = "خطا: از حالت فشرده خارج نمي شود."
WARN_EXECUTE = "اخطار : به منظور استخراج فایل ها از این نوع ، پرونده باید به طور مستقیم مشخص شود.  دستور شما ادامه می یابد ، دستور زیر را اجرا كنيد :  این فایل احتمالا ممکن است مخرب باشد، توصیه می شود که شما به دستور ادامه ندهيد. می خواهید با استخراج ادامه هستید؟"

; Help text
HELP_SUMMARY = "استخراج فایل ازهر نوع فايل آرشیو و یا هر برنامه نصب شده ي ديگر."
HELP_SYNTAX = "%nUsage:  %s [/راهنما | /پيش ساخته] [نام فايل [مقصد]]"
HELP_ARGUMENTS = "%n%nانواع ساپورت هاي قابل قبول:"
HELP_HELP = "%n     /راهنما%t%tنمايش اطلاعات راهنما"
HELP_PREFS = "%n     /پيش ساخته%t%tتنظيمات خروجي را تنظيم كنيد"
HELP_FILENAME = "%n     نام فايل%tنام براي خروجي فايل"
HELP_DESTINATION = "%n     مقصد%tمقصد براي قرار گرفتن خروجي"
HELP_SUB = "%n%nPassing /sub instead of a destination directory name instructs%n%s to extract to subdirectory named after the archive."
HELP_EXAMPLE1 = "%n%nنمونه:"
HELP_EXAMPLE2 = "%n     %s c:\1\example.zip c:\test"
HELP_NOARGS = "%n%nمحل عبور /بدون هیچ گونه استدلالي برقرار خواهد شد%n%s کاربر بر نام فایل و دایرکتوری مقصد نمي تواند اعمالي داشته باشد ."

; Error messages
CANNOT_LOG = "%sخروجي ها را نمی توان وارد سایت كرد."
CANNOT_DEBUG = "اشکالزدایی دایرکتوری فایل خروجی, "%s", بازگشت "قابل نوشتن نیست.%nدایرکتوری ها به جای آن استفاده می شود".."
CANNOT_EXTRACT = "%s این پرونده را نمی توان استخراج كرد.%nفرمت هاي خروجي عبارتست از: %s%n%nClick خوب اگر شما می خواهيد به تجزیه و تحلیل خود ادامه دهيد تاييد یا اگر انصراف مي دهيد خروج را بزنيد."
UNKNOWN_EXT = "%s%فرمت قابل قبول نيست و نمي توان استخراج شود."
INVALID_DIR = "%s%nنمي توان ايجاد كرد.  يك قسمت ديگر را انتخاب كنيد."
EXTRACT_FAILED = "%s این پرونده نمی تواند استخراج شود.%nبه نظر ميرسد كه  %s, از آن حمايت مي شود, اما نمي توان آن را استخراج كرد.%nمراجعه كنيد %s, براي اطلاعات بيشتر.%n%nبراي مشاهده پرونده اکنون وارد بخش مدیریت شوید ، و یا براي انصراف به خروج را بزنيد."

[Installer]
; Components page
COMP_DOCS = "مجوز مستندات و اطلاعات"
COMP_LANG = "فایل های زبان برای حمایت بین المللي"
COMP_ACE = "پشتیبانی از فایل های ace"
COMP_KGB = "پشتیبانی از فایل های KGB"
COMP_PEA = "پشتیبانی از فایل های Pea"
COMP_SIT = "پشتیبانی از فایل های StuffIt"

; Preferences page
PREFS_CAPTION = "تنظیم گزینه های برنامه"
PREFS_DESCRIPTION = "به کدام گزینه های جهانی استخراج تمایل دارید ؟"
PREFS_LABEL1 = "شما ممکن است گزینه های زیر را برای تنظیم پیش فرض  جهانی استخراج قبول كنيد."
PREFS_LABEL2 = "این گزینه ها را می توان پس از نصب ، با تغییر،تغییر دهيد UniExtract.ini."
LANGUAGE_LABEL = "زبان پیش فرض"
DEBUG_LABEL = "اشکال زدایی محل فایل"
APPEND_EXT_LABEL = "& افزودن پسوندهای جديد فایل"
HISTORY_LABEL = "&نگهداری و آرشیو تاریخ"
REMOVE_DUPE_LABEL = "حذف پرونده های تکراری"
REMOVE_TEMP_LABEL = "حذف فایل های موقت"
WARN_EXECUTE_LABEL = "& اخطارهاي قبل از اجرای فایل"

; Tasks page
ASSOCIATE = "&فعال کردن و ادغام چهار چوب  منوي اکسپلورر"
ASSOCIATE_FILES = "اضافه کردن UniExtract & فایلها و... را به چهار چوب منو"
ASSOCIATE_HERE = "اضافه کردن UniExtract و در اینجا به چهار چوب منو"
ASSOCIATE_SUBDIR = "اضافه کردن UniExtract و Subdir به چهار چوب منو"
ASSOCIATE_FORCE = "ارتباط با تمام فرمت های آرشیو پشتیبانی"
MODIFY_PATH = "افزودن به سیستم جهانی استخراج و مسیر شما"
DESKTOP_ICON = "ساخت و آیکون دسکتاپ"
QUICK_LAUNCH_ICON = "ساخت و راه اندازی سریع آیکون"
SENDTO_ICON = "ایجاد یک ارسال و برای آیکون"

; Context Menu integration
EXTRACT_FILES = "واحد خروج & فایلها و..."
EXTRACT_HERE = "واحد خروج &در اینجا"
EXTRACT_SUB = "واحد خروج به &تابع دي اي ار"
